[
  {
    "title": "German exports up in March but weak orders spoil party",
    "content": "FRANKFURT, Germany — German exports picked up in March but industrial orders fell unexpectedly, official data showed Tuesday, reflecting a mixed picture for Europe’s biggest economy.Exports rose by 0.9 percent month-on-month after a decline of 1.6 percent in February, federal statistics agency Destatis said, defying expectations of a continued downward trend.But new orders, closely watched as an indicator of future business activity, fell by 0.4 percent month-on-month.Analysts surveyed by FactSet had expected a rise of 0.45 percent.ING bank analyst Carsten Brzeski said the figures published Tuesday confirmed “the return of the export-driven German growth model”.READ: German exports lose momentum in FebruaryHowever, the weak industrial orders “spoiled the party of optimism”, he said, illustrating “the high risk that the revival of the export-oriented success formula is only short-lived”.March orders were propped up by strong demand from the eurozone, but domestic orders fell by 3.6 percent and those from the rest of the world were down by 2.9 percent.Exports to the European Union rose by 0.5 percent compared with February, and those to the rest of the world also increased by 1.3 percent.Imports to Germany meanwhile were up by 0.3 percent month-on-month in March, with the country’s trade surplus coming in at 22.3 billion euros.High inflation, costly energy, and weaker demand from key market China have weighed heavily on Germany’s key manufacturing sector in recent months.READ: German industrial output fell more than expected in DecemberHowever, an expected recovery in domestic and foreign demand will mean that “incoming orders are expected to trend upwards again as the year progresses”, the economy ministry said in a statement.The German government slightly increased its 2024 growth forecast in April to 0.3 percent, up from a previous prediction of 0.2 percent.The German economy grew by 0.2 percent in the first quarter of the year, dodging a recession after a weak end to 2023.",
    "date": "May 07, 2024"
  },
  {
    "title": "Metro Pacific Health acquires Parañaque Doctors Hospital",
    "content": "MANILA, Philippines — Metro Pacific Health Corp. (MPH) of billionaire Manuel V. Pangilinan has acquired a majority stake in UHBI-Parañaque Doctors Hospital (PDH) further expanding its footprint in the National Capital Region.MPH on Tuesday said PDH was its 10th hospital in Metro Manila.“Paranaque City is a key market between Makati and Muntinlupa, which MPH has been keen to have a presence in,” MPH president Augie Palisoc Jr. said in a statement.READ: Metro Pacific Health innovates healthcare delivery in the countryThe 21-year-old PDH is a seven-story facility sitting on a 6,000-square-meter land in Parañaque. It started commercial operations on May 8, 2007.",
    "date": "May 07, 2024"
  },
  {
    "title": "IMF projects Japan’s GDP to fall to world’s 5th after India in 2025",
    "content": "TOKYO – Japan’s nominal gross domestic product will be overtaken by India’s and slip from No. 4 in the world to No. 5 next year, according to projections by the International Monetary Fund.The IMF’s April report projected India’s GDP will be $4.339 trillion in 2025, while Japan’s GDP will stand at $4.310 trillion. The 2025 timing is a year earlier than previous projections, reflecting the yen’s depreciation.India, with more than 1.4 billion people, has the world’s largest population and maintains high economic growth. According to the IMF, India’s real GDP growth rate was 7.8 percent in 2023, while Japan’s was 1.9 percent.In addition to the country’s strong domestic demand, the Indian government has encouraged foreign companies to bring their production to India. Its GDP is expected to surpass Germany’s in 2027 and rise to third place.READ: Japan Q4 GDP revised up to slight expansion, economy avoids recessionJapan dropped to the world’s fourth-largest economy after Germany in 2023.In 1968, during a period of high economic growth, Japan overtook West Germany to become the world’s second-largest economy. In 2010, however, China overtook Japan following a prolonged recession in the latter after the collapse of the bubble economy.Nominal GDP is affected by international exchange rates and boosted by rising prices.READ: Yen falls further as Bank of Japan stands pat on ratesOn April 29, the yen temporarily dropped to 160 against the dollar, its weakest level in about 34 years. The yen has weakened by as much as 20 against the dollar compared to earlier this year.The decline of Japan’s economy also reflects the country’s prolonged stagnation.Businesses have responded to protracted deflation by prioritizing cost-cutting and failed to adequately invest earnings domestically.“With the weak yen and the current recovery from deflationary trends, companies should increase domestic investment and build a structure of economic growth,” said Keiji Kanda, senior economist at Daiwa Institute of Research.",
    "date": "May 07, 2024"
  },
  {
    "title": "Women’s emancipation, breaking generational curses examined in ‘Guardia de Honor’",
    "content": "Allen Dizon (left) and Laurice Guillen–JAY ALTAREJOSIndie filmmaker Jay Altarejos is organizing a limited release for “Guardia de Honor” in the Philippines “to provide our fellow Filipinos with the opportunity to experience the film that resonated with Russian cineastes and was enjoyed by our compatriots in Russia,” he said.The tragic drama, starring Laurice Guillen, Sunshine Cruz and Therese Malvar, had its world premiere at the 2024 Moscow International Film Festival in Russia, which ran from April 19 to 26. It is all about “the emancipation of womanhood,” according to Altarejos, who also wrote and edited it.Altarejos said there were some questions during the film’s Q&A session in Moscow that he found interesting. “First, they inquired about the choice of black and white for the film,” he told Inquirer Entertainment. “The decision to present the film in black and white was driven by a desire to distill it to its essence, free from the potential distractions of color.“Additionally, it pays homage to the rich history of cinema, which originated in black and white. In a contemporary context, amid the advancements in filmmaking, it’s poignant to recall the timeless sentiment: ‘My life is cinema, black-and-white cinema.’”Altarejos recalled that there was also a question on the inclusion of a clip featuring the presidential inauguration of Ferdinand Marcos Jr. He explained, “The film depicts women overcoming patriarchy and misogyny, yet it also underscores the enduring influence of patriarchy within our society. This is evidenced by our collective history of oppression, reflected in the election of leaders like [Rodrigo] Duterte, emblematic of misogyny and patriarchy, and now Marcos Jr., son of a former dictator.”“Guardia de Honor” is based on the story of an off duty policeman who shot dead at point-blank range his elderly female neighbor and her son in Paniqui, Tarlac, in 2020. “We’re organizing a limited release in the Philippines,” said Altarejos.The film is set on the eve of the presidential inauguration, when the seemingly happy life of a middle class family is shattered after police officer Eddie Boy (Allen Dizon) gets arrested for killing the mother and her son.Altarejos considers his own mother the most influential woman in his life, even though he had a conflicted relationship with her. “Even now that she’s gone, I’m still grappling with the memories—whether they were pleasant or not—but as I get older, the more I appreciate women and mothers. How are you able to manage? You conceive, go through those nine difficult months, raise your child and take all these in.“I remember how she would react whenever I ended painful relationships. I was already an adult, so I resented her for that. But I guess a mother never ceases to be one, no matter how old her child becomes.“‘Guardia de Honor’ tells the stories of our women, because I’m always moved by their strength and bravery. I still remember the songs she sang to us, her wanderlust. She wasn’t meant to be in that place (Ticao Island in Masbate), and so she came to Manila and brought us with her. I also saw her independence. She was widowed at 46 and she had four kids to raise. She never left us, even if this meant defying our grandmother.”Therese who plays Marie, Eddie Boy’s timid daughter and granddaughter of Laurice’s character Mamang Anita, had this to say when asked what lesson she wanted the audience to learn from her character. “There is hope even in the darkest situation, as long as you stick with each other and help one another. Also, try as hard as you can to break that generational curse. Just like in the movie, what happens within the family in real life sometimes becomes a vicious cycle. Be brave enough to break it.”Sunshine’s character, Minda (Marie’s aunt), lacks self-confidence and is afraid of Mamang. “Have courage, speak up. You can’t just keep hiding what you feel,” Sunshine stressed. “It’s hard to sleep at night if you’re carrying a heavy emotional baggage. That’s what I always say even to my own daughters. ‘Let’s talk about it. We will all help in trying to fix it.’ That’s what I want to teach our audience. Communicating with family is very important.”Laurice agreed with Therese about being brave enough to break the generational curse. “Anita herself is just like Minda and Marie because she kept it all to herself,” she pointed out. “You have to respect yourself, as well. If you don’t because of fear, or because you seek approval, you might lose yourself in the process. The most important thing you should ask yourself is, ‘Who am i really?’ If you cannot answer that, then you’re in trouble.” INQ",
    "date": "May 07, 2024"
  },
  {
    "title": "How Heart Evangelista’s ‘kaartehan’ turned her into a global fashion icon",
    "content": "Heart Evangelista –MARINEL CRUZ“What will you do with all your money if you’re not happy?”This was actress and fashion icon Heart Evangelista’s reply to Inquirer Entertainment’s question on what else she’s still praying for, career-wise, these days.Even though she has not been accepting film or TV work lately, Heart is still the subject of news stories with her successes as a major brand endorser in the country, as well as her fast-rising status as a global fashion icon.“Honestly, I have nothing more to ask for in my career. I’m thankful that after being in this industry for 25 or 26 years, I’m still doing what I love doing. I just wish for good health for myself and my loved ones, especially my dad. That’s what will truly make me happy. Everything else is a bonus,” the 39-year-old celebrity said at a recent launch of Avon’s latest intimate apparels, #360ComfortBras.Heart said she does not simply agree to endorsing a product. It also has to be something she can relate to. “Some people think that, because you present yourself in a certain way on Instagram, you’re already perfect. Avon isn’t just about the shape, but also a woman’s personality; about owning your truth, embracing your flaws, forgiving yourself or being kind to yourself. I feel like it’s the whole package. So when I was told that it’s all about women empowerment, I felt that it was also something for myself, to encourage me to empower myself even more,” she explained.The latest Avon campaign carries the theme, “Shape the World, Embrace Your Power,” and Heart has this to say about it: “It simply means that, in your own little way, you can help the community around you. I may not be super famous, but whoever follows me hopefully learns from my story, from my life. What you see on my YouTube channel, or what I post on Instagram, will hopefully help shape people or give them a glimpse of hope. I don’t have a perfect life. I try to be honest as much as I can, so with that, I hope to inspire them to just keep on going with their lives,” said the wife of Sen. Francis Escudero.In another interview, Heart said she was pleasantly surprised that a lot of people tolerate her “kaartehan” (fussiness). This time, Heart explained what she meant: “May narating ang kaartehan ko: from my very first role as Missy in [the TV series] ‘G-Mik’ to Portia in [the movie] ‘Tanging Ina.’ Puro kakikayan ang alam ko, but because I try to be as authentic as possible, it is taking me to where I am, which is Fashion Week. I’m just very grateful for that. I don’t consider what I do now as a job—it’s what I love to do. The lesson here is that being authentic will take you somewhere. It’s not easy, but I promise you, it will.”Heart said she is determined to “empower women with this body.” She explained: “I am considered ‘very petite’ in the world of fashion. But we’re really made from different cuts, so, to me, it’s all about embracing your imperfections and being comfortable with them. I hope that will be enough to help people boost their confidence.”In a recent Instagram reel, she is seen bonding and having fun with two women, wearing only a bra top. Heart was then asked how she was able to muster the confidence to shoot the video and post it on Instagram. “It’s all about your experience in life. When I was younger, I was very hard on myself. As I got older, I sort of developed self-worth. I learned to love myself more, gain more confidence,” she pointed out. “I feel like all of these make sense now. I am proud to be the woman I am today and this wouldn’t have happened if I didn’t go through life.”She continued: “Being confident is hard to do. I don’t feel good about myself all the time, especially on social media. If you put yourself out there, you should be open to accepting all the comments, good or bad. But I feel immune to that already. I’m stronger now. It’s definitely empowering to use what I’ve learned in my life to, in a sense, inspire and help other women.”Asked to give her advice to women, Heart said: “This is also for those who do not feel at ease with who they are: It’s alright. It’s normal. But with a little more effort—koting pitik, konting suntok, konting push—you will be able to build your self-worth. You only need to love yourself and the rest will follow. And even if other people don’t love you, it doesn’t matter. If those around you love you, that’s all you need.” INQ",
    "date": "May 06, 2024"
  },
  {
    "title": "‘FranSeth’ on replacing ‘KathNiel,’ finding love via dating apps",
    "content": "Seth Fedelin (left) and Francine Diaz, collectively known as “FranSeth” —SETH FEDELIN/ INSTAGRAMIt’s a possibility,” said Seth Fedelin when asked whether or not he and love-team partner Francine Diaz are already dating, five years after “FranSeth” was formed.“I’m being a gentleman, so I’m answering the question now. It’s possible for us to reach that level in the future, but we will soon be making our first movie, so that is our priority right now,” Seth told reporters during a story conference organized by Regal Entertainment for their romantic drama “My Future You.”“To be honest, dating is still far from my mind. I don’t want to feel pressured to have a romantic relationship with Francine right now. First of all—I always say this—I respect her and her parents. I admit that Francine and I talk about this, but I will not elaborate. In time, we will be able to give a more definite answer to this particular question.”Francine agreed and added: “I guess it will not diminish my being a woman if I say it’s likely for Seth and me to end up together, especially because we still have a lot of projects lined up for us after this movie. We are always together and this gives us more opportunities to get to know each other. Based on how I know Seth now, it’s not difficult to fall for him, but as he said, love is not our priority at the moment. There’s a right time for it.”Francine and Seth were also asked to share their reactions to comments comparing them to the popular tandem of Kathryn Bernardo and Daniel Padilla or “KathNiel.” Kathryn and Daniel started dating a year after their love team was formed in 2011, and broke up in 2023.“If you say that our love team is ‘the next KathNiel,’ this implies that we will also have to go through a similar journey. Seth and I agreed that we want to be known based on our own merits, as FranSeth. Personally, I feel pressured by the fact that they see KathNiel in us,” said Francine.Seth confessed that the idea actually makes him nervous. “What if we don’t meet people’s expectations? We don’t want to be KathNiel. I will not become another Daniel. That’s impossible,” he insisted.“I guess in terms of the success they’ve achieved as a team—they made a lot of hit movies—we want to achieve that, too. Workwise, what KathNiel has accomplished is no joke. The two contributed so much to this industry through their talent as actors, while Francine and I are still so new. If people expect FranSeth to reach the same level of success that KathNiel has achieved, then this means Francine and I should also prepare for a long and difficult journey,” he pointed out.Francine, however, pleaded to KathNiel supporters not to take Seth’s comment negatively. “Don’t get us wrong. We’re friends with KathNiel. Ate Kath and I always greet each other. She’s very kind, and so is Kuya DJ (Daniel’s nickname). We just want to make it clear that we are not here to replace KathNiel,” she declared.The two are scheduled to shoot their first big-screen project starting May 8. The film is written and directed by Cris B. Aquino (“Write About Love”).Francine cited the biggest difference between working on a movie compared to a television series, something which she and Seth are used to doing.“You are less likely to commit a mistake when doing a film because you are able to track what you have filmed so far and which direction you’re heading. Scripts for TV shows are often revised. Sometimes, you will be made to do a story plot again and again, only for it to be removed later on,” she observed. “This is why I’m both excited and nervous to start shooting. I also feel that it’s been a while since I last acted in a movie. Everything that we will be doing here will feel new to me.”In “My Future You,” a strange comet connects two timelines, 15 years apart, making Karen (Francine) and Lex (Seth) connect through a dating app. As they discover that they live in different years, they try to change the past to have a better future, but every change seems to lead to undesirable effects.When asked to share her views on finding true love through dating apps, Francine said she does think of herself credible enough to publicly express an opinion on it since she has not tried it herself.“I feel like I’m not the right person to answer the question. I’d like to believe that there’s forever in dating apps because I have friends and relatives who have found romantic partners through dating apps. They’re still together up to now,” she began.“For me, it doesn’t matter how you find love, as long as you’re happy and don’t hurt other people in the process—just go for it. While I believe there’s true love in dating apps, I also think you can find it in family, friends and within yourself. It just depends on how you define it.”Seth hasn’t tried finding a partner through dating apps, “even though I also know of people who have,” the actor told reporters. He then turned to Francine, and said: “I have no intention of trying it.”The film, first conceptualized four years ago, also features Christian Vazquez, Almira Muhlach, Peewee O’Hara, Bodjie Pascua, Mosang and Vance Larena.",
    "date": "May 05, 2024"
  },
  {
    "title": "Malaysia acid-attack footballer ‘critical but stable’",
    "content": "(FILES) Malaysia’s forward #07 Faisal Halim runs with the ball during the Qatar 2023 AFC Asian Cup Group E football match between Bahrain and Malaysia at the Jassim bin Hamad Stadium in Doha on January 20, 2024. Malaysian national footballer Faisal Halim suffered second-degree burns after he was splashed with acid in an attack at a shopping mall over the weekend, a sports official has said. (Photo by KARIM JAAFAR / AFP)A Malaysian national team footballer who was the victim of an acid attack is in a “critical but stable” condition Tuesday with fourth-degree burns that will require more surgery, a football official told AFP.Faisal Halim suffered burns on the neck, shoulder, hands and chest in Petaling Jaya district outside the capital Kuala Lumpur over the weekend.Nicknamed “Mickey”, the 26-year-old plays on the right wing for Selangor Football Club and Malaysia.“I am at the hospital. Faisal’s condition is a bit critical but stable,” Football Association of Selangor deputy president Shahril Mokhtar told AFP via a text message.He said Faisal was initially diagnosed as having suffered second-degree burns, “but after he was moved to another hospital, a plastic surgeon classified the injuries as fourth-degree burns.”Shahril said Faisal would undergo another surgery, adding that his movement and speech had been affected.“We are shocked and disappointed that such an attack happened in Malaysia. My concern is also about the mental health of the other players since the new season begins on Friday,” he said.CEO of Selangor Football Club Johan Kamal Hamidon said security has been heightened for the players, officials and staff of the club but he did not elaborate.Selangor state police chief Hussein Omar Khan told reporters that investigations over the motive for the attack continued and that two suspects had been arrested.A photo that went viral online showed a visibly shocked and shirtless Faisal seated on a bench with burn marks on his upper body.The acid attack came three days after another national team player, Akhyar Rashid, was injured in a robbery outside his home in the eastern state of Terengganu.Kuala Terengganu police chief Azli Mohamad Noor said the incidents were unrelated.Football Association of Malaysia president Hamidin Mohamad Amin urged high-profile footballers to take precautions about their personal safety, including hiring bodyguards.“If you are a big player, you can consider what the overseas footballers are doing, which is to get a bodyguard,” he was quoted as saying by The Star newspaper.",
    "date": "May 07, 2024"
  },
  {
    "title": "Paula Badosa, Stefanos Tsitsipas announce break-up",
    "content": "FILE– Paula Badosa of Spain and Stefanos Tsitsipas/ Matthew Stockman/Getty Images/AFPPaula Badosa says she and Stefanos Tsitsipas are no longer a love match. The tennis power couple has broken up.Badosa wrote on social media Sunday that the pair “decided to amicably part ways” after being a couple since last year.“We have shared a journey filled with love and learning, and it is as friends with immense mutual respect that we now choose to move forward on our own paths,” Badosa posted. “We are grateful for the support of our friends, family, and all who have been part of our story. As we transition into this new chapter of our lives, we continue to wish each other nothing but the best in all our endeavors.”READ: Love match at Wimbledon for power couple Stefanos Tsitsipas, Paula BadosaBadosa is a 26-year-old who was born in New York City but represents Spain and has been ranked as high as No. 2. She is currently No. 101 after a series of injuries that have limited her tournament appearances lately.Her record is 6-9 this season. The best Grand Slam showing of Badosa’s career was a run to the quarterfinals at the 2021 French Open.“The tennis level is there, but I need to recover emotionally,” Badosa said after a first-round loss at the Madrid Open on April 24 in her most recent match. “Every week is a disappointment. I’ve been at the top and it’s tough to see myself at the bottom right now.”Tsitsipas also dropped his first match in Madrid, although he did win the Monte Carlo Masters and was the runner-up at the Barcelona Open before that.He is a 25-year-old from Greece who has been ranked as high as No. 3 and is now No. 7. Tsitsipas twice has been a finalist at Grand Slam tournaments, finishing as the runner-up to 24-time major title winner Novak Djokovic both times — at the 2021 French Open and at the 2023 Australian Open.",
    "date": "May 07, 2024"
  },
  {
    "title": "Celtics, Cavs clash in NBA playoffs for first time since 2018",
    "content": "Jaylen Brown #7 of the Boston Celtics gathers in a loose ball in front of Donovan Mitchell #45 of the Cleveland Cavaliers during the second half at TD Garden on December 14, 2023 in Boston, Massachusetts. (Photo By Winslow Townson/Getty Images)BOSTON — One of the things Celtics forward Jaylen Brown remembers about his time inside the NBA Florida bubble in 2020 during the pandemic was his random sightings of Donovan Mitchell.Mitchell, then with the Utah Jazz, seemed to pop up in the common spaces of the bubble at the same time as Brown. It led to humorous fodder on social media between the pair and helped form a friendship between the young stars that continues today.But none of that is on Brown’s mind this week as the East’s top-seeded Celtics prepare to open their second-round series with Mitchell’s Cleveland Cavaliers.“Ain’t no friends in the playoffs,” Brown said. “You’ve just got to get ready to play. That’s all I have to say on that.”Mitchell, who also calls Boston All-Star Jayson Tatum a friend, said he stopped talking to them when the bracket was finalized.“It’s all competition and I expect nothing but the best from them and vice versa,” he said. “And we got to go out there and take care of business in a hostile environment. … It’s going to be fun. And I’m excited.”After dispatching the Miami Heat in five games in the first round, Boston will open Game 1 of its series with Cleveland on Tuesday night as heavy favorites, according to BetMGM.The Celtics will be getting a Cavaliers team playing on just a day’s rest following a Game 7 win over Orlando in which they rallied from an 18-point deficit to advance.That game saw Mitchell score 39 points, boosting his scoring average to 28.7 points this postseason. It includes a 50-point performance in Game 6 against the Magic. After not seeing Miami’s Jimmy Butler in the opening round, Mitchell will be the first dynamic scorer Boston has faced this postseason.Cleveland’s resiliency came on the heels of a regular season that saw the Cavaliers have a 23-5 stretch before the All-Star break before finishing the season 12-17. It featured a swath of injuries, including a nagging left knee issue for Mitchell. Starting center and defensive anchor Jarrett Allen also missed the final three games of the Magic series with a painful rib injury.Before getting hurt, Allen had been arguably Cleveland’s steadiest and most durable player since November. He missed five games to open the year before playing in 77 straight while averaging a career-high 16.5 points, 10.5 rebounds and 2.7 assists.Allen is questionable for Game 1, with reserve big man Dean Wade ruled out with a sprained right knee.Cavs coach J.B. Bickerstaff believes he saw his team’s true identity during their Game 7 win over Orlando.“This group in particular has been through so much this year, a group who’s been left for dead multiple times by a lot of people this year,” he said. “For them to come together in this moment and figure it out, it’s more about the group than me. We’re most proud of that, but we’re not done.”For the Celtics, 7-footer Kristaps Porzingis is also out for the series opener as he continues to rehab from the strained right calf that caused him to miss the finale of the Heat series.While Allen seems likely to return at some point in this series, Porzingis could be out most, if not all, of this round.Boston coach Joe Mazzulla said his team is ready to adjust as needed, just like it did to close out Miami.“It really doesn’t matter what situation we’re in, what matters is making sure we’re ready to play,” Mazzulla said.This will be the first meeting between the teams since Cleveland outlasted Boston in the 2018 Eastern Conference finals to secure their fourth straight Finals. The Cavalierss won Game 7 of that series at the Garden, led by LeBron James’ 35 points.This will be the ninth time the teams have met in the playoffs and fourth since 2015.The 2018 meeting was Brown’s second career playoff run and the first for Tatum.Cleveland was the hunted team in the East then. Now the table’s been turned.“That was a long time ago. 2018? Sheesh,” Brown said. “I feel like I’ve come a long way. Obviously, that was a great experience and journey being able to play in the playoffs. At that time they had LeBron. It still stings a little bit that we lost in the end in Game 7. I’ll make sure this series is a little different.”Cleveland hasn’t traveled well in the playoffs the past two years, losing all five road games by an average 19.4 points – and Boston won’t be rolling out the welcome mat.The Cavaliers were clobbered in Game 1 at Orlando, losing by 38 points, the most lopsided loss in team playoff history. They got beat by 23 in Game 2 before keeping it relatively close and losing Game 3 by just 7.The team’s road issues extend to the regular season as Cleveland dropped seven of its last eight in the regular season away from home.The Cavs lost their two games in Boston — in a three-night span — in December.It turned out to be a painful short stay as Darius Garland suffered a broken jaw in the Dec. 14 game when he bumped into Porzingis on a drive to the basket.",
    "date": "May 07, 2024"
  },
  {
    "title": "Nat’l Fiber Backbone launched, starting with Laoag-QC phase",
    "content": "Imagine a time when even your neighborhood “sari-sari” store, mechanic or shoeshine boy can do business or build a customer base both on- and offline.A government project offering such possibilities was launched on Friday, giving micro, small and medium enterprises (MSMEs) an opportunity to thrive in the digital space.“This is the infrastructure that will open employment opportunities, improve market efficiency, attract foreign investments and stimulate livelihood across the different sectors of our economy and our society,” President Ferdinand Marcos Jr. said of the National Fiber Backbone (NFB) project.READ: Marcos eyes internet access for all via National Fiber Backbone project“We get to the point where the sari-sari store doesn’t sell only to the village. The sari-sari store can sell anywhere and that brings us into the digital space. Even what we referred to as nano enterprises. I’m talking about the shoeshine boy, the mechanic who has had jobs,” he said, citing examples of how the NFB can narrow the “digital divide.”To be implemented under the National Broadband Program of the Department of Information and Communications Technology, the first phase of the NFB will cover 1,245 kilometers from Laoag City in Ilocos Norte to Quezon City.It will be composed of 28 nodes and, with the completion of the next five phases by 2026, is expected to increase the internet penetration rate in the country from the current 33 percent to 65 percent, or 70 million out of 115 million Filipinos.With an initial 600 gigabits per second optical spectrum capacity, the NFB Phase 1 will extend a digital lifeline to more than 3,000 free Wi-Fi sites, translating to fast internet access to around 750,000 beneficiaries in Ilocos Norte, Central Luzon and Metro Manila.“[It’s a] very big push to bring MSMEs into the digital space” and “guarantee the people’s enjoyment of the internet as a basic human right,” the President added during the launch held at Sofitel Philippine Plaza Hotel in Pasay City.Aside from giving the local economy a boost, the NFB will also serve the needs of government agencies and the communities on its path, including 14 provinces in northern and Central Luzon, two national government data centers, and four ecozones, he added.The first phase can improve the efficiency of 346 national and local government offices connected to the Government Network and result in savings of up to more than P145 million every year. —Julie M. Aurelio",
    "date": "April 20, 2024"
  },
  {
    "title": "Meta taps AI vs ‘sextortion’",
    "content": "PARIS — Meta said on Thursday it was developing new tools to protect teenage users from “sextortion” scams on its Instagram platform, which has been accused by US politicians of damaging the mental health of youngsters.Gangs run sextortion scams by persuading people to provide explicit images of themselves and then threatening to release them to the public unless they receive money.READ: Meta moves to protect teens from unwanted messages on Instagram, FacebookMeta said it was testing an artificial intelligence (AI)-driven “nudity protection” tool that would find and blur images containing nudity that were sent to minors on the app’s messaging system.“This way, the recipient is not exposed to unwanted intimate content and has the choice to see the image or not,” Capucine Tuffier, who is in charge of child protection at Meta France, told Agence France-Presse (AFP).The US company said it would also offer advice and safety tips to anyone sending or receiving such messages.Some 3,000 young people fell victim to sexploitation scams in 2022 in the United States, according to the authorities there.Separately, more than 40 US states began suing Meta in October in a case that accuses the company of having “profited from children’s pain.”The legal filing alleged Meta had exploited young users by creating a business model designed to maximize time they spend on the platform despite harm to their health.Meta announced in January it would roll out measures to protect under-18s that included tightening content restrictions and boosting parental supervision tools.The firm said on Thursday that the latest tools were building on “our long-standing work to help protect young people from unwanted or potentially harmful contact.”“We’re testing new features to help protect young people from sextortion and intimate image abuse, and to make it more difficult for potential scammers and criminals to find and interact with teens,” the company said.It added that the “nudity protection” tool used “on-device machine learning,” a kind of AI, to analyze images.The firm, which is also constantly accused of violating the data privacy of its users, stressed that it would not have access to the images unless users reported them.Meta said it would also use AI tools to identify accounts sending offending material and severely restrict their ability to interact with young users on the platform.Whistleblower Frances Haugen, a former Facebook engineer, publicized research in 2021 carried out internally by Meta—then known as Facebook—which showed the company had long been aware of the dangers its platforms posed for the mental health of young people.",
    "date": "April 13, 2024"
  },
  {
    "title": "Content creators worry about miseducation in a world without TikTok",
    "content": "LOS ANGELES—It was December 2020 during the height of the COVID-19 pandemic when “Ms James,” a public school teacher in a small rural Southern town, realized that her virtual students were not watching the grammar lessons she assigned them. That is, until she posted them on TikTok.Everything changed when she learned about the social media platform and created her profile as @iamthatenglishteacher.“In a day, I had 1,000 followers, in a week I had 10,000, and in six weeks I had 100,000 followers,” she told Reuters.“Within six months, I had a million and a half,” added the teacher of 15 years, who asked not to use her full name for privacy.Now, she has 5.8 million followers on TikTok, but her educational content now faces a threat.The US House of Representatives overwhelmingly passed a bill last week that will give TikTok’s Chinese owner ByteDance about six months to divest the US assets of the short-video app, or face a ban. It’s the greatest threat since the Trump administration to the app, and to the content creators who reach wide audiences and often earn their living on it.“When you talk about the ban, you are talking about taking access to high-quality educational videos away from people who have used it to enhance their education,” Ms James said.While her TikTok lessons are used by students ranging from elementary school to college, most of her followers are English as a second language students from the Philippines as well as homeschooled students.From videos on subject-verb agreement to vocabulary, Ms James believes that her legacy is to help the world through education and fears a ban would be detrimental.“I think that TikTok is a wealth of knowledge,” NaomiHearts, a content creator known by her 1.1 million followers for her TikTok videos about fatphobia and trans Chicana identity, told Reuters.She also fears that the ban will silence diverse, informative content, including her own.However, University of Southern California (USC) professor Karen North warns her students that personal data is in danger on TikTok.“My concern with TikTok is less about what information is provided or manipulated or whether it’s skewed toward one message or another,” North, the founder and former director of USC Annenberg’s Digital Social Media program told Reuters.“It’s more toward what kind of personal information are people voluntarily giving up to an entity that does not have the same standards for privacy that we (the United States) do. That’s the big issue with TikTok,” she added.North, a former White House employee for the Clinton administration at Capitol Hill, worries the Chinese company’s use of functions like facial recognition and location tracking creates threats that outweigh the engaging benefits of the app, including in academia.Content creator Dr. Anthony Youn, known for his educational TikTok videos exploring his profession as a plastic surgeon, believes the ban would have significant drawbacks on information accessibility.“There’s a huge segment of TikTok where you get your news, so it’s about being educated,” Dr. Youn, who has 8.4 million followers, told Reuters.Similarly, NaomiHearts feels the ban is less about protecting data, as other apps also collect personal information, and more about denying consumers informative content.",
    "date": "March 23, 2024"
  }
]
